What is POSIX? Describe.

What is $$ in bash scripting?
 - $$ is the process ID (PID) of the script itself.

1. What is the opposite function of malloc() in C?

2. What Unix function lets a socket receive connections?

3. How many bytes are necessary to store a MAC address?

4. Sort the time taken by: CPU register read, disk seek, context switch, system memory read.

5. What is a Linux inode?

6. What Linux function takes a path and returns an inode?

7. What is the name of the KILL signal?
8. Why Quicksort is the best sorting method?
9. There's an array of 10,000 16-bit values, how do you count the bits most efficiently?
10. What is the type of the packets exchanged to establish a TCP connection?
1. How much should you charge to wash all the windows in Seattle?
2. Why are manhole covers round?
3. You need to check that your friend Bob has your correct phone number, but you cannot ask him directly. You must write the question on a card and give it to Eve who will take the card to Bob and return the answer to you. What must you write on the card, besides the question, to ensure that Bob can encode the message so that Eve cannot read your phone number?
4. How many piano tuners are there in the entire world?
5. Every man in a village of 100 married couples has cheated on his wife. Every wife in the village instantly knows when a man other than her husband has cheated but does not know when her own husband has. The village has a law that does not allow for adultery. Any wife who can prove that her husband is unfaithful must kill him that very day. The women of the village would never disobey this law. One day, the queen of the village visits and announces that at least one husband has been unfaithful. What happens?
6. A man pushed his car to a hotel and lost his fortune. What happened?
7. How many times a day does a clock's hands overlap?
8. How many vacuums are made per year in the USA?
9. Explain the significance of "dead beef."
10. If a person dials a sequence of numbers on the telephone, what possible words/strings can be formed from the letters associated with those numbers?
11. You are shrunk to the height of a nickel and your mass is proportionally reduced so as to maintain your original density. You are then thrown into an empty glass blender. The blades will start moving in 60 seconds. What do you do?
12. How many golf balls can fit in a school bus?
13. Explain a database in three sentences to your 8-year-old nephew.
14. You have to get from point A to point B. You don't know if you can get there. What would you do?
15. You are at a party with a friend and 10 people are present (including you and the friend). Your friend makes you a wager that for every person you find who has the same birthday as you, you get $1; for every person he finds who does not have the same birthday as you, he gets $2. Would you accept the wager?
oracle-java8-unlimited-jce-policy
what does apt-get -f install
How to resolve hostname? - nslookup
LRU cache- last recently used
What is for command ldd?

What is EC2 instance?   An EC2 instance is a virtual server in Amazon’s Elastic Compute Cloud (EC2) for running applications on the Amazon Web Services (AWS) infrastructure.
On demand vs reserved instances in aws, what is the difference?
    - With On-Demand instances, you pay for compute capacity by the hour with no long-term commitments or upfront payments. You can increase or decrease your compute capacity depending on the demands of your application and only pay the specified hourly rate for the instances you use.
    -

What is a PTR record?
You can think of the PTR record as an opposite of the A record. While the A record points a domain name to an IP address, the PTR record resolves the IP address to a domain/hostname.

What is ERP system? Enterprise resource planning.
What is LIMS system? Labaoratory information management system.
What is Scada system? Supervisory control and Data aquisition system - used for monitoring industria processes,systems etc.

What is variadic function? It's a funtion/method which arity is unknown, in Java for example (String ... params)

The 8 stages Octagonal testing.: Understandable, Operable, Controllable, Observable, Consistent, Simple, Maintainable and Automatable.

{
  "qa": [
          {
      "category": [
        "ALGORITMIZATION"
      ],
      "Q": " How  Fail  Fast Iterator  come to know that the internal structure is modified ?",
      "A": [
       "Iterator read internal data structure (object array) directly . The internal data structure(i.e object array) should not be modified while iterating through the collection. To ensure this it maintains an internal  flag \"mods\" .Iterator checks the \"mods\" flag whenever it gets the next value (using hasNext() method and next() method). Value of mods flag changes whenever there is an structural modification. Thus indicating iterator to throw ConcurrentModificationException."
       ]
    },
    {
      "category": [
        "ADMIN","LINUX","BASH"
      ],
      "Q": "How to execute action on many nodes at once?",
      "A": [
       "pssh -t 0 -h list-nodes.txt -l dspdev01 -P 'date'"
     ]},
      {
      "category": [
        "ADMIN","LINUX","BASH"
      ],
      "Q": "How to determine which shell is user running?",
      "A": [
       "ps -p $$ "
     ]},
          {
      "category": [
        "ADMIN","LINUX","BASH"
      ],
      "Q": "How to login under the bash shell?",
      "A": [
       "which bash, whereis bash, setenv SHELL /bin/bash, exec /bin/bash --login"
     ]},
    {
      "category": [
        "SOFTWARE_ENGINEERING","DEVELOPMENT","MAVEN"
      ],
      "Q": " What is semantic versioning?",
      "A": [
       "2.0.0. MAJOR version when you make incompatible API changes, MINOR version when you add functionality in a backwards-compatible manner, PATCH version when you make backwards-compatible bug fixes.http://semver.org/"
       ]},

          {
      "category": [
        "BASH","UNIX","GREP","ADMIN"
      ],
      "Q": "Grep return codes?",
      "A": [
       "Normally the exit status is 0 if a line is selected, 1 if no lines were selected, and 2 if an error occurred. However, if the -q or --quiet or --silent option is used and a line is selected, the exit status is 0 even if an error occurred. Other grep implementations may exit with status greater than 2 on error."
     ]},
                     {
      "category": [
        "HDFS","WEBHDFS"
      ],
      "Q": "Why there are 2 steps to putfile with webhdfs?",
      "A": [
       "Becuase the request is redirected to a datanode where the file data is to be written."
       ]},
      {
      "category": [
        "HADOOP","ADMIN","YARN"
      ],
      "Q": "Describe FairScheduler versus Capacity scheduler",
      "A": [
       " "
     ]},
      {"category": [
        "DOCKER"
      ],
      "Q": "where is the docer file and how to install it",
      "A": [
       " "
     ]},

      {
      "category": [
        "HADOOP","ETL","HIVE"
      ],
      "Q": "What is bucketing, why and when you will use it?",
      "A": [
       " "
     ]},
      {
      "category": [
        "HADOOP"
      ],
      "Q": "Parquet format, how it looks like, what are advantages vs disadvantages?",
      "A": [
       " "
     ]},
                     {
      "category": [
        "SOFTWARE_ENGINEERING","DEVELOPMENT","MAVEN"
      ],
      "Q": "What means exclusions in maven dependency, why you need it?",
      "A": [
       "exclude the unwanted dependency, typical example is logging included in some library"
       ]},
                     {
      "category": [
        "SOFTWARE_ENGINEERING","DEVELOPMENT","MAVEN"
      ],
      "Q": "Maven dependency management vs dependencies ?",
      "A": [
       "Typicaly for managing version, then the versions are not in dependency, can be used for exclusions"
       ]},                     {
      "category": [
        "SOFTWARE_ENGINEERING","DEVELOPMENT","MAVEN"
      ],
      "Q": "Maven Why using properties in this fomrat ${property name} rather than plain dependency?",
      "A": [
       "list of properties is easier, when I am using it as parent,then I can override easily the version"
       ]},                     {
      "category": [
        "SOFTWARE_ENGINEERING","DEVELOPMENT","MAVEN"
      ],
      "Q": "?",
      "A": [
       ""
       ]},                     {
      "category": [
        "SOFTWARE_ENGINEERING","DEVELOPMENT","MAVEN"
      ],
      "Q": "What is effective pom, why you need it?",
      "A": [
       ""
       ]},
   {
      "category": [
        "ADMIN","UNIX","SECURITY","KERBEROS"
      ],
      "Q": "What is KRB5CCNAME?",
      "A": [
       "Location  of  the  Kerberos  5 credentials (ticket) cache. Used for the enviroment in which is script running. If cache_name or keytab_name is not  specified,  klist  will  display  the credentials in the default credentials cache or keytab file as appropriate.  If the  KRB5CCNAME  environment variable  is  set,  its  value  is  used to name the default ticket cache."
         ]
    },
    {
      "category": [
        "ADMIN","UNIX","SHELL"
      ],
      "Q": "What means <code>set -e</code>?",
      "A": [
       "If a command fails, set -e will make the whole script exit, instead of just resuming on the next line. If you have commands that can fail without it being an issue, you can append || true or || : to suppress this behavior — for example set -e followed by false || : will not cause your script to terminate."
        ]
    },
        {
      "category": [
        "ADMIN","UNIX","SHELL"
      ],
      "Q": "What means <code>set -u</code>?",
      "A": [
       "Treat unset variables as an error, and immediately exit"
        ]
    },
        {
      "category": [
        "ADMIN","UNIX","SHELL"
      ],
      "Q": "What means <code>set -o pipefail</code>?",
      "A": [
       "set -o pipefail causes a pipeline (for example, curl -s http://sipb.mit.edu/ | grep foo) to produce a failure return code if any command errors. Normally, pipelines only return a failure if the last command errors. In combination with set -e, this will make your script exit if any command in a pipeline errors."
        ]
    },
        {
      "category": [
        "ADMIN","UNIX","SHELL","BASH"
      ],
      "Q": "What means <code>$?</code>?",
      "A": [
       "This variable holds the last command return code."]
    },

   {
      "category": [
        "ADMIN","UNIX","SECURITY"
      ],
      "Q": "What is SASL?",
      "A": [
       "Simple Authentication and Security Layer (SASL) is a framework for authentication and data security in Internet protocols. It decouples authentication mechanisms from application protocols, in theory allowing any authentication mechanism supported by SASL to be used in any application protocol that uses SASL."
     ]
    },
              {
      "category": [
        "ADMIN","NETWORK"
      ],
      "Q": " What is VPC (vitual port channel)?",
      "A": [
       "A virtual PortChannel (vPC) allows links that are physically connected to two different Cisco Nexus™ 5000 Series devices to appear as a single PortChannel to a third device. The third device can be a Cisco Nexus 2000 Series Fabric Extender or a switch, server, or any other networking device."]
    },
           {
      "category": [
        "OPEN_SOURCE","SOLUTION_ARCHITECT","APACHE"
      ],
      "Q": " What does Apache Karaf?",
      "A": [  "Karaf provides dual polymorphic container and application bootstrapping paradigms to the Enterprise.  Karaf can run as a standalone container, supporting a wide range of applications and technologies. Karaf enables us to build calvaDrive as modern modular web application consisting of one hundred OSGi bundles at the moment."
  ]},

  {
      "category": [
        "HDFS","HADOOP","BIGDATA"
      ],
      "Q": "two main components of HDFS?",
      "A": [
   "      HDFS is composed by: – a namenode hosting the metadata of the filesystem (directories, blocks location, file permissions or modes, …). There is only one namenode per HDFS, and the metadata are stored in memory by default.– a set of datanode hosting the file blocks. Files are composed by blocks (like in all filesystems). The blocks are located on different datanodes. The blocks can be replicated."]
    },
  {
      "category": [
        "UNIX","ADMIN"
      ],
      "Q": "What is in the /dev folder?",
      "A": [
        "/dev/ is the part in the unix directory tree that contains all \"device\" files -- unix traditionally treats just about everything you can access as a file to read from or write to.
"
 ]},
  {
      "category": [
        "UNIX","ADMIN"
      ],
      "Q": "What is behind dev/sd[a-z][/d] name for exaple what mean s /dev/sda9?",
      "A": [
        "sd originally identified a SCSI device, but since the wildgrowth of USB (and other removable) data carriers it became a catch-all for any block device, The letter immediately after sd signifies the order in which it was first found -- a,b,c...z, the number after that signifies the partition on the device. "
 ]},
    {
      "category": [
        "ADMIN","AWS","CLOUD"
      ],
      "Q": "What EBS stands for?",
      "A": [
             "Amazon Elastic Block Store provides persistent block level storage volumes for use with Amazon EC2 instances in the AWS Cloud.  Each Amazon EBS volume is automatically replicated within its Availability Zone to protect you from component failure, offering high availability and durability. "
 ]},
   {
      "category": [
        "LINUX","DEVOPS","UNIX","ADMIN"
      ],
      "Q": " How to run application as a service?",
      "A": [
   "There are several approaches: tools/folder/commands to consider are: init.d or systemd, chkconfig, update-rc.d, systemctl "]
    },
    {
      "category": [
        "DEVELOPMENT","DEBUGGING","DEVOPS","UNIX"
      ],
      "Q": " What does nc -l <PORT> ?",
      "A": [
   "netcat utility, serves simple HTTP server responding with ok and displaying the content of the request, used for testing and debugging purpose, write response back in console"]
    },
    {
      "category": [
        "DEVOPS","UNIX","BASH"
      ],
      "Q": " What does sudo -E ?",
      "A": [
   "sudo -E preserves the user environment, including any proxy config"]},
              {
      "category": [
        "DEVELOPMENT","DATABASES","DATA_PROCESSING"
      ],
      "Q": " What is pivot table ?",
      "A": [
       "In data processing, a pivot table is a data summarization tool found in data visualization programs such as spreadsheets or business intelligence software. Among other functions, a pivot table can automatically sort, count, total or give the average of the data stored in one table or spreadsheet, displaying the results in a second table showing the summarized data"  ]
    },
              {
      "category": [
        "DEVOPS","HADOOP"
      ],
      "Q": " How to run hdfs commands with debug in one line?",
      "A": [
       "HADOOP_ROOT_LOGGER=DEBUG,console hdfs dfs -ls"]
    },
        {
      "category": [
        "JAVA"
      ],
      "Q": "What is syntethic method?",
      "A": [
      "It is a Java construct that is introduced by the compiler. Any constructs introduced by the compiler that do not have a corresponding construct in the source code must be marked as synthetic, except for default constructors and the class initialization method." ]
    },
    {
      "category": [
        "JAVA","JPA","ANNOTATIONS","JAVA EE","JAVA EE 6"
      ],
      "Q": "What means @Lob?",
      "A": ["Specifies that a persistent property or field should be persisted as a large object to a database-supported large object type. Portable applications should use the Lob annotation when mapping to a database Lob type. The Lob annotation may be used in conjunction with the Basic annotation or the ElementCollection annotation when the element collection value is of basic type. A Lob may be either a binary or character type.The Lob type is inferred from the type of the persistent field or property, and except for string and character-based types defaults to Blob."]
      },
        {
      "category": [
        "JAVA","JPA","ANNOTATIONS","JAVA EE","JAVA EE 6"
      ],
      "Q": "What are supported types for annotation @Lob?",
      "A": ["A Lob may be either a binary or character type."]
      },
              {
      "category": [
        "JAVA","SPRING","ANNOTATIONS","SPRING_ANNOTATIONS"
      ],
      "Q": "Annotation @ResponseEntity?",
      "A": ["Spring: ResponseEntity is meant to represent the entire HTTP response. You can control anything that goes into it: status code, headers, and body."]
      },
      {
      "category": [
        "JAVA","SPRING","ANNOTATIONS","SPRING_ANNOTATIONS"
      ],
      "Q": "Annotation @ResponseBody, @ResponseStatus",
      "A": ["Spring: @ResponseBody is a marker for the HTTP response body and @ResponseStatus declares the status code of the HTTP response."]
      },
      {
      "category": [
        "JAVA","SPRING","ANNOTATIONS","SPRING_ANNOTATIONS"
      ],
      "Q": "Why is @ResponseStatus annotation not so flexible?",
      "A": ["@ResponseStatus isn't very flexible. It marks the entire method so you have to be sure that your handler method will always behave the same way. And you still can't set the headers. You'd need the HttpServletResponse or a HttpHeaders parameter. Basically, ResponseEntity lets you do more."]
      },
     {
      "category": [
        "JAVA","SPRING","ANNOTATIONS","SPRING_ANNOTATIONS"
      ],
      "Q": "Wha are meta-annotations and why are only Spring specific?",
      "A": ["This mechanism, where you can have \"meta-annotations\" that are themselves annotated with other annotations, which then apply to the class on which you put your meta-annotation, is something that is specific to the Spring Framework. It is not a standard feature of Java annotations.It doesn't work because JUnit does not understand this mechanism. The @RunWith annotation is a JUnit annotation. JUnit does not understand that it should look at the annotations that are on your @ControllerTest meta-annotation.So, this mechanism works with annotations that are processed by Spring, but not with annotations that are processed by other tools such as JUnit."]},
     {
      "category": [
        "JAVA","JPA"
      ],
      "Q": "What are the default fetchTypes for basic,OneToMany,ManyToMany?",
      "A": ["Basic - eager, other lazy"]
      },
           {
      "category": [
        "ECLIPSE"
      ],
      "Q": "What does Maven Update Project do in Eclipse?",
      "A": ["It syncs the Eclipse project settings with that of the pom. If you for example change important plugin settings, such as the output java version, you will find that Eclipse will ask you to update the project and afterwards the configured Java runtime in the project will have changed to reflect what your Maven pom indicates."]
      },

      {
      "category": [
        "DEVOPS","LINUX"
      ],
      "Q": "What is cgroup?",
      "A": ["cgroups (abbreviated from control groups) is a Linux kernel feature that limits, accounts for, and isolates the resource usage (CPU, memory, disk I/O, network, etc.) of a collection of processes."]
      },
      {
      "category": [
        "JAVA"
      ],
      "Q": "When you need JRE instead of JRE in production?",
      "A": ["The JDK is required when you need something to be compiled on the fly. Example JSP. Note:Some Servlet Containers (like Tomcat5.5 and Jetty6) don't require a JDK for JSPs.",
            "It is also usefull when you want to use tools for profiling/monitoring the application"
            ]
      },
      {
      "category": [
        "JAVA"
      ],
      "Q": "Difference between JDK and JRE?",
      "A": ["JRE is a part of JDK, JDK provides set of tools to develop and run Java."
            ]
      },
     {
      "category": [
        "DATABASES","JAVA"
      ],
      "Q": "Differences between JDBC and ODBC",
      "A": [
            "JDBC is multi-threaded - ODBC is not multi-threaded (at least not thread safe)",
            "ODBC is a windows-specific technology - JDBC is specific to Java",
            "ODBC is procedural and language independent - JDBC is object oriented and language dependent (specific to java)",
            "JDBC is faster - ODBC is slower",
            "ODBC is an open interface which can be used by any application to communicate with any database system"
      ]
      },
     {
      "category": [
        "LINUX","DEVOPS"
      ],
      "Q": "What are the standart commands for look at processors and memory information?",
      "A": [
            "cat /proc/cpuinfo",
            "cat /proc/meminfo",
            "free -mth",
            "top",
            "htop"
      ]
      },
     {
      "category": [
        "SHELL","DEVOPS","BASH","UNIX","LINUX"
      ],
      "Q": "What means \"#! /bin/bash?\" at the beginning of shell script?",
      "A": ["In computing, a shebang is the character sequence consisting of the characters number sign and exclamation mark (#!) at the beginning of a script. Under Unix-like operating systems, when a script with a shebang is run as a program, the program loader parses the rest of the script's initial line as an interpreter directive; the specified interpreter program is run instead, passing to it as an argument the path that was initially used when attempting to run the script."]
      },
     {
      "category": [
        "SHELL","DEVOPS","BASH","UNIX","LINUX"
      ],
      "Q": "What does TEE command.",
      "A": ["reads standard input and writes it to both standard output and one or more files, effectively duplicating its input"]},

     {
      "category": [
        "SHELL","DEVOPS"
      ],
      "Q": "Mention some other shebangs.",
      "A": [
          "#!/bin/sh — Execute the file using sh, the Bourne shell, or a compatible shell",
          "#!/bin/csh — Execute the file using csh, the C shell, or a compatible shell",
          "#!/usr/bin/perl -T — Execute using Perl with the option for taint checks",
          "#!/usr/bin/php — Execute the file using the PHP command line interpreter",
          "#!/usr/bin/python -O — Execute using Python with optimizations to code",
          "#!/usr/bin/ruby — Execute using Ruby",
          "#!/bin/awk",
          "#!/bin/ksh"
      ]
      },
     {
      "category": [
        "LINUX","COMMANDLINE"
      ],
      "Q": "How to list all users in Unix systems?",
      "A": ["Cut -d: f1 /etc/passwd"]
      },
     {
      "category": [
        "GIT"
      ],
      "Q": "What means git pull?",
      "A": ["In its default mode, git pull is shorthand for git fetch followed by git merge FETCH_HEAD. Git pull runs git fetch with the given parameters and calls git merge to merge the retrieved branch heads into the current branch. With --rebase, it runs git rebase instead of git merge."]
      },
           {
      "category": [
        "GIT"
      ],
      "Q": "How to checkout remote branch?",
      "A": ["git checkout -b NEW_LOCAL_BRANCH_NAME remotes/origin/REMOTE_BRANCH_NAME. Then is good to set upstream "] },
      {
      "category": [
        "DATABASES"
      ],
      "Q": "What is transation mode SERIALIZATION?",
      "A": ["All statements of the current transaction can only see rows committed before the first query or data-modification statement was executed in this transaction. If a pattern of reads and writes among concurrent serializable transactions would create a situation which could not have occurred for any serial (one-at-a-time) execution of those transactions, one of them will be rolled back with a serialization_failure error."]
      },
      {
      "category": [
        "VIM","DEVOPS"
      ],
      "Q": "What is dd?",
      "A": ["Cuts the line in buffer, it has side effect."]
      },
      {
      "category": [
        "LINUX","BASH"
      ],
      "Q": "Convert uppercase to lower case.",
      "A": ["tr '[A-Z]' '[a-z]' < $filename"]
      },
      {
      "category": [
        "JAVA","ALGORITMIZATION"
      ],
      "Q": "What is transation mode SERIALIZATION?",
      "A": [
          "Simple values like 0.1 cannot be precisely represented using binary floating point numbers, and the limited precision of floating point numbers means that slight changes in the order of operations or the precision of intermediates can change the result. That means that comparing two floats to see if they are equal is usually not what you want.",
          "== or != is not good practise",
          "the results you get will depend on your compiler and your compiler settings",
          "There is no silver bullet. One of methods can be that their difference goes under some epsilon(error), but the tricky part is to choose epsilon." ]
      },
           {
      "category": [
        "HADOOP","HIVE"
      ],
      "Q": "What is HCatalog?",
      "A": ["HCatalog is a table and storage management layer for Hadoop that enables users with different data processing tools — Pig, MapReduce — to more easily read and write data on the grid. HCatalog goal is Present users of these tools an abstraction that removes them from details of where and in what format data and metadata are stored"]
      },
            {
      "category": [
        "DATABASES"
      ],
      "Q": "What is transation mode READ COMMITED",
      "A": ["A statement can only see rows committed before it began. This is the default."]
      },
            {
      "category": [
        "DATABASES"
      ],
      "Q": "What is transation mode REPETABLE READ",
      "A": ["All statements of the current transaction can only see rows committed before the first query or data-modification statement was executed in this transaction."]
      },
      {
      "category": [
        "ALGORITMIZATION","DATA_STRUCTURES","BLOOM_FILTER"
      ],
      "Q": "What is bloom filter?",
      "A": ["A Bloom filter is a space-efficient probabilistic data structure, conceived by Burton Howard Bloom in 1970, that is used to test whether an element is a member of a set. False positive matches are possible, but false negatives are not, thus a Bloom filter has a 100% recall rate."]
      },
      {
      "category": [
        "ALGORITMIZATION","DATA_STRUCTURES","BLOOM_FILTER"
      ],
      "Q": "What is typical usage of bloom filter?",
      "A": ["the technique for applications where the amount of source data would require an impractically large amount of memory, with limited core memory, Bloom's technique uses a smaller hash area but still eliminates most unnecessary accessesFor example, a hash area only 15% of the size needed by an ideal error-free hash still eliminates 85% of the disk accesses"]
      },
      {
      "category": [
        "CLUSTER","DEVOPS","HADOOP"
      ],
      "Q": "How you will test clusters setup. What to use for cluster benchmarking?",
      "A": ["Terragen, Terrasort"]
       },
      {
      "category": [
        "GRADLE","INFRASTRUCTURE"
      ],
      "Q": "What  is Gradle?",
      "A": ["Gradle is an open source build automation system that builds upon the concepts of Apache Ant and Apache Maven and introduces a Groovy-based domain-specific language (DSL) instead of the XML form used by Apache Maven of declaring the project configuration. Gradle uses a directed acyclic graph (\"DAG\") to determine the order in which tasks can be run."]
      },
           {
      "category": [
        "JENKINS","INFRASTRUCTURE"
      ],
      "Q": "What  is Jenkins?",
      "A": ["Jenkins is a cross-platform, continuous integration and continuous delivery application"]
      },
         {
      "category": [
        "INFRASTRUCTURE","ABBREVIATION"
      ],
      "Q": "What does DSL mean?",
      "A": ["Domain specific language."]
      },
      {
      "category": [
        "INFRASTRUCTURE","ABBREVIATION"
      ],
      "Q": "What does the DAG stands for?",
      "A": ["Direc acyclic graph."]
      },
            {
      "category": [
        "KIBANA","ELASTICSEARCH","INFRASTRUCTURE"
      ],
      "Q": "How can you secure Kibana?",
      "A": ["Nglix"]
      },
    {
      "category": [
        "LANGUAGES","GROOVY"
      ],
      "Q": "What is groovy?",
      "A": ["Pptionally typed and dynamic language, with static-typing and static compilation capabilities. COmpiles to bytecode, runs on JVM. "]
      },
    {
      "category": [
        "INFRASTRUCTURE","ANSIBLE"
      ],
      "Q": "What is supervisorctl.",
      "A": ["Ansible module or managing state of a program or group of programs."]
      },
    {
      "category": [
        "JAVA","GENERICS"
      ],
      "Q": "What is a bounded wildcard and what is an unbounded wildcard?",
      "A": [
      "<? extends T> and <? super T> are examples of bounded wildcards. An unbounded wildcard looks like <?>."]
    },
   {
      "category": [
        "JAVA","GENERICS"
      ],
      "Q": "Bounded wildcard, what it is and how it looks?",
      "A": ["A bounded wildcard (<? extends T> or <? super T>) places a restriction on the type by saying that it either has to extend a specific type (<? extends T> is known as an upper bound), or has to be an ancestor of a specific type (<? super T> is known as a lower bound)."]
    },
    {
      "category": [
        "JAVA","GENERICS"
      ],
      "Q": "What means ? in generics like <?> ?",
      "A": ["<?>, and basically means <? extends Object>. It loosely means the generic can be any type."]
    },
    {
      "category": [
        "UNIX"
      ],
      "tags":["UNIX","BASH","COMMANDLINE"],
      "Q": "What are named pipes?",
      "A": [
      "Like un-named/anonymous pipes, named pipes provide a form of IPC (Inter-Process Communication). With anonymous pipes, there's one reader and one writer, but that's not required with named pipes—any number of readers and writers may use the pipe."
       ]
    },
      {
      "category": [
        "JAVA","ANNOTATIONS","SPRING","SPRING 4"
      ],
      "Q": "What means @Around.",
    "A": ["Around advice: Advice that surrounds a join point such as a method invocation. example:@Around(\"@annotation(some.package.with.annotation.Transactional)\")" ]
    },
    {
      "category": [
        "FULLTEXT"
      ],
      "Q": "What is bloom filter?",
      "A": ["A Bloom filter is a data structure that can store elements in a fixed number of bits and tell you whether it’s seen those elements before when you query it. " ]
    },
        {
      "category": [
        "ECLIPSE","SHORTCUTS"
      ],
      "Q": "Open outline shortcut.",
      "A": ["Ctrl + O , MAC: Cmd + O" ]
    },
            {
      "category": [
        "HTTP","WEB"
      ],
      "Q": "What means code 400?",
      "A": ["Bad request"]
    },
                {
      "category": [
        "HTTP","WEB"
      ],
      "Q": "What means code 404?",
      "A": ["Not found" ]
    },
                {
      "category": [
        "HTTP","WEB"
      ],
      "Q": "What means code 403?",
      "A": ["Forbidden" ]
    },
            {
      "category": [
        "JAVA","ANNOTATIONS","SPRING","SPRING 4"
      ],
      "Q": "What means annotation @Service in Spring framework?",
      "A": ["Indicates that an annotated class is a \"Service\" (e.g. a business service facade). This annotation serves as a specialization of @Component, allowing for implementation classes to be autodetected through classpath scanning." ]
    },
        {
      "category": [
        "JAVA","ANNOTATIONS"
      ],
      "Q": "What means annotation @Retention?",
      "A": ["Indicates how long annotations with the annotated type are to be retained." ]
    },
    {
      "category": [
        "JAVA","ANNOTATIONS"
      ],
      "Q": "What are the possible values for annotation @Retention?",
      "A": ["SOURCE,CLASS,RUNTIME" ]
    },
    {
      "category": [
        "JAVA","ANNOTATIONS"
      ],
      "Q": "What are the possible values for annotation @Target - ElementType?",
      "A": [" TYPE,FIELD,METHOD,PARAMETER,CONSTRUCTOR,LOCAL_VARIABLE,ANNOTATION_TYPE,PACKAGE" ]
    },
        {
      "category": [
        "JAVA","ANNOTATIONS"
      ],
      "Q": "What means RetentionPolicy.SOURCE?",
      "A": ["RetentionPolicy.SOURCE: Discard during the compile. These annotations don't make any sense after the compile has completed, so they aren't written to the bytecode. Example: @Override, @SuppressWarnings" ]
    },
            {
      "category": [
        "JAVA","ANNOTATIONS"
      ],
      "Q": "What means RetentionPolicy.CLASS?",
      "A": ["RetentionPolicy.CLASS: Discard during class load. Useful when doing bytecode-level post-processing. Somewhat surprisingly, this is the default." ]
    },
        {
      "category": [
        "JAVA","ANNOTATIONS"
      ],
      "Q": "What means RetentionPolicy.RUNTIME?",
      "A": ["Do not discard. The annotation should be available for reflection at runtime. Example: @Deprecated" ]
    },
 {
      "category": [
        "JAVA","ANNOTATIONS"
      ],
      "Q": "What is the default value of @Retention?",
      "A": ["If no Retention annotation is present on an annotation type declaration, the retention policy defaults to RetentionPolicy.CLASS." ]
    },
     {
      "category": [
        "JAVA","ANNOTATIONS"
      ],
      "Q": "What is the default value of @Target?",
      "A": ["If a Target meta-annotation is not present on an annotation type declaration, the declared type may be used on any program element" ]
    },
     {
      "category": [
        "JAVA","ANNOTATIONS"
      ],
      "Q": "What means annotation @Target?",
      "A": ["Indicates the kinds of program element to which an annotation type is applicable." ]
    },

    {
      "category": [
        "WEB","REST"
      ],
      "Q": "What is the difference between PUT and POST?",
      "A": ["Do you name your URL objects you create explicitly, or let the server decide? If you name them then use PUT. If you let the server decide then use POST.PUT is idempotent, so if you PUT an object twice, it has no effect. This is a nice property, so I would use PUT when possible.You can update or create a resource with PUT with the same object URLWith POST you can have 2 requests coming in at the same time making modifications to a URL, and they may update different parts of the object.example: POST /expense-report, PUT  /expense-report/10929" ]
    },
    {
      "category": [
        "ECLIPSE","SHORTCUTS"
      ],
      "Q": "Open type hierarchy.",
      "A": ["Ctrl + T , MAC: Cmd + T" ]
    },
    {
      "category": [
        "SOFTWARE TESTING"
      ],
      "Q": "What is sanity test.",
      "A": ["It is simplet test that some statement is true. The advantage of a sanity test, over performing a complete or rigorous test, is speed." ]
    },
        {
      "category": [
        "JAVA"
      ],
      "tags":["JAVA","GARBAGE COLLECTIONS"],
      "Q": "What is the default garbage collector in Java 8?",
      "A": [
      "Parallel GC"
      ]
    },
        {
      "category": [
        "UNIX"
      ],
      "tags":["UNIX","BASH","COMMANDLINE","NAMED_PIPES"],
      "Q": "How are named pipes implemented?",
      "A": [
      "TODO"
      ]
    },
    {
      "category": [
        "UNIX"
      ],
      "tags":["UNIX","BASH","COMMANDLINE"],
      "Q": "How do you create named pipes?",
      "A": [
      "Named pipes are created via mkfifo or mknod: $ mkfifo /tmp/testpipe, $ mknod /tmp/testpipe p"
      ]
    },
    {
      "category": [
        "UNIX"
      ],
      "tags":["UNIX","BASH","COMMANDLINE","SHELL","CODE"],
      "Q": "What does the following code?",
      "code":{
          "format":"bash",
          "content":"
#!/bin/bash

pipe=/tmp/testpipe

trap \"rm -f $pipe\" EXIT

if [[ ! -p $pipe ]]; then
    mkfifo $pipe
fi

while true
do
    if read line <$pipe; then
        if [[ \"$line\" == 'quit' ]]; then
            break
        fi
        echo $line
    fi
done

echo \"Reader exiting\"",

      },
      "A": [
      "The following shell script reads from a pipe. It first creates the pipe if it doesn't exist, then it reads in a loop till it sees \"quit\"."
      ]
    },

    {
      "category": [
        "ALGORITMIZATION"
      ],
      "Q": "Will throw ConcurrentModificationException method set() on Arraylist? Why/why not?",
      "A": [
       "No. A structural modification is any operation that adds or deletes one or more elements, or explicitly resizes the backing array; merely setting the value of an element is not a structural modification."
       ]
    },
                      {
      "category": [
        "JAVA"
      ],
      "Q": "What is parameter -Xmx<size>.",
      "A": [
      "Sets maximum Java heap size. The memory flag can also be specified in multiple sizes -Xmx1024k, -Xmx512m, -Xmx8g. The Xms flag has no default value, and Xmx typically has a default value of 256MB. A common use for these flags is when you encounter a java.lang.OutOfMemoryError.When using these settings, keep in mind that these settings are for the JVM's heap, and that the JVM can/will use more memory than just the size allocated to the heap."
       ]
    },
                      {
      "category": [
        "JAVA"
      ],
      "Q": "What is parameter -Xms<size>.",
      "A": [
      "Sets initial Java heap size."
       ]
    },
                 {
      "category": [
        "ALGORITMIZATION"
      ],
      "Q": "Which classes in Java have fail fast iterators.",
      "A": [
       "HashMap,Vector,ArrayList,HashSet"
       ]
    },
            {
      "category": [
        "ALGORITMIZATION"
      ],
      "Q": "Which classes in Java have fail safe iterators.",
      "A": [
       "CopyOnWriteArrayList,ConcurrentHashMap"
       ]
    },
            {
      "category": [
        "ALGORITMIZATION"
      ],
      "Q": "What is fail-fast and fail safe iterators?",
      "A": [
        "Fail Safe Iterator makes copy of the internal data structure (object array) and iterates over the copied data structure.Any structural modification done to the iterator affects the copied data structure.Fail fast iterator while iterating through the collection , instantly throws Concurrent Modification Exception if there is structural modification  of the collection . Thus, in the face of concurrent modification, the iterator fails quickly and cleanly, rather than risking arbitrary, non-deterministic behavior at an undetermined time in the future. "
      ]
    },
        {
      "category": [
        "ALGORITMIZATION"
      ],
      "Q": "What is fail-fast and fail safe iterators?",
      "A": [
        "Fail Safe Iterator makes copy of the internal data structure (object array) and iterates over the copied data structure.Any structural modification done to the iterator affects the copied data structure.Fail fast iterator while iterating through the collection , instantly throws Concurrent Modification Exception if there is structural modification  of the collection . Thus, in the face of concurrent modification, the iterator fails quickly and cleanly, rather than risking arbitrary, non-deterministic behavior at an undetermined time in the future. "
      ]
    },
      {
      "category": [
        "ALGORITMIZATION"
      ],
      "Q": "Which copy technique (deep or shallow ) is used by the TreeMap clone() method ?",
      "A": [
        "shallow"
      ]
    },
          {
      "category": [
        "ALGORITMIZATION"
      ],
      "Q": "Why  java's  treemap does not allow an initial size ?",
      "A": [
        "HashMap reallocates its internals as the new one gets inserted while TreeMap does not reallocate nodes on adding new ones. Thus , the size of the TreeMap  dynamically increases if needed , without shuffling the internals. So it is meaningless to set the initial size of the TreeMap ."
      ]
    },
 {
      "category": [
        "HADOOP","YARN"
      ],
      "Q": "What means Yarn acronym?",
      "A": [
        "Yet Another Resource Manager"]
    },
 {
      "category": [
        "HADOOP","YARN"
      ],
      "Q": "What does org.apache.hadoop.yarn.util.resource.DefaultResourceCalculator vaule for property yarn.scheduler.capacity.resource-calculator",
      "A": [
        "DefaultResourceCalculator uses only memory information for allocating containers and CPU scheduling is not enabled by default."]
    },
 {
      "category": [
        "ADMIN","UNIX","DEVOPS"
      ],
      "Q": "What are ulimits and where to set it up?",
      "A": [
        "ulimit provides control over the resources available to the shell and to processes started by it, on systems that allow such control. File is /etc/security/limits.conf"]
    },
  {
      "category": [
        "ADMIN","UNIX","DEVOPS","SECURITY"
      ],
      "Q": "describe /etc/security/limits.conf ",
      "A": [
        "Each line describes a limit for a user in the form:<domain> <type> <item> <value>, domain:username/groupname/wildcards, type:soft/hard, item:core-limits the core file size(KB), value: core/data/fsize/memlock/nofile/rss/stack/cpu/nproc/as/maxlogins/maxsyslogins/priority/locks/sigending/msgqueue/nice.rtprio/chroot "] },
 {
      "category": [
        "ADMIN","UNIX","DEVOPS"
      ],
      "Q": "Ulimit: soft limit vs hard limit?",
      "A": [
        "The soft limit is the value that the kernel enforces for the corresponding resource. The hard limit acts as a ceiling for the soft limit."]
    },
     {
      "category": [
        "ADMIN","UNIX","DEVOPS"
      ],
      "Q": "What does nslookup?",
      "A": [
        "nslookup is a network administration command-line tool available for many computer operating systems for querying the Domain Name System (DNS) to obtain domain name or IP address mapping or for any other specific DNS record."]
    },
 {
      "category": [
        "ADMIN","UNIX","DEVOPS"
      ],
      "Q": "Ulimit: soft limit vs hard limit?",
      "A": [
        "The soft limit is the value that the kernel enforces for the corresponding resource. The hard limit acts as a ceiling for the soft limit."]
    },
 {
      "category": [
        "ADMIN","UNIX","DEVOPS"
      ],
      "Q": "Ulimit how does it affect root user?",
      "A": [
        "no effect on the root user or any process with the CAP_SYS_ADMIN or CAP_SYS_RESOURCE capabilities are not affected by this kind of limitation on a Linux based system.
"]

    },
     {
      "category": [
        "ADMIN","UNIX","DEVOPS"
      ],
      "Q": "/etc/pam.d/?",
      "A": [
        "configuration files TODO
        "]},
     {
      "category": [
        "ADMIN","UNIX","DEVOPS"
      ],
      "Q": "Which processes are not affected by ulimt??",
      "A": [
        "no effect on the root user or any process with the CAP_SYS_ADMIN or CAP_SYS_RESOURCE capabilities are not affected by this kind of limitation on a Linux based system.
"]
    },
 {
      "category": [
        "HADOOP","YARN"
      ],
      "Q": "What does org.apache.hadoop.yarn.util.resource.DominantResourceCalculator vaule for property yarn.scheduler.capacity.resource-calculator",
      "A": [
        "DominantResourceCalculator uses both memory as well as the CPU, the resource calculator "]
    },
 {
      "category": [
        "UNIX","ADMIN","DEVOPS"
      ],
      "Q": "What is fork bomb and how to prevent it.",
      "A": [
        "Restricting per user processes ( -u) can be useful for limiting the potential effects of a fork bomb."]
    },

   {
      "category": [
        "HADOOP","YARN"
      ],
      "Q": "What sets property yarn.scheduler.capacity.resource-calculator",
      "A": [
        "DominantResourceCalculator, DefaultResourceCalculator - how the resources for container will be calculated "]
    },
       {
      "category": [
        "HADOOP","YARN"
      ],
      "Q": "What sets property yarn.scheduler.capacity.resource-calculator",
      "A": [
        "DominantResourceCalculator, DefaultResourceCalculator - how the resources for container will be calculated "]
    },
       {
      "category": [
        "ALGORITMIZATION","JAVA"
      ],
      "Q": "What is the range of 32-bit signed two's complement integer",
      "A": [
        "minimum value of -2,147,483,648 and a maximum value of 2,147,483,647"]
    },
           {
      "category": [
        "JDBC","JAVA","DATABASES"
      ],
      "Q": "What is the difference between obdc6.jar a nd odbc14.jar?",
      "A": [
        "The number menas version of Java, so odbc14 is compatible for 1.4 Java and the 6 for 1.6 and more (actually it is certified also for 6,7,8)"]
    },
    {
      "category": [
        "LINUX","DEVOPS"
      ],
      "Q": "What means <code>sudo: no tty present and no askpass program specified.</code>",
      "A": [
        "the command is not part of your path (and the full path is not specified). You can fix it by either adding the command to your PATH or invoking it with an absolute path, i.e."]
    },
    {
      "category": [
        "LINUX","DEVOPS","ADMIN"
      ],
      "Q": "How to list all users",
      "A": [
        "All users are in file /etc/paswd, so you can look with this command <code>cut -d: -f1 /etc/passwd</code>"
      ]
      },

           {
      "category": [
        "LINUX","DEVOPS"
      ],
      "Q": "How you chek that the LDAP is up and running from command line?",
      "A": [
        "ldapsearch -LLL -x -h \"IP or HOST\" -b \"dc=gin,dc=merck,dc=com\""]
    },
           {
      "category": [
        "SQOOP","BIGDATA","DEV"
      ],
      "Q": "How to import table without primary key and what does it mean in Sqoop?",
      "A": [
        "-m 1 = use only one mapper, or --split-by <column_name> -> say to sqoop on wich column split for mapping"]
    },

       {
      "category": [
        "HADOOP","YARN"
      ],
      "Q": "What sets property yarn.scheduler.capacity.resource-calculator",
      "A": [
        "DominantResourceCalculator, DefaultResourceCalculator - how the resources for container will be calculated "]
    },
       {
      "category": [
        "HADOOP","YARN"
      ],
      "Q": "What are you setting with arn.scheduler.capacity.root.<queue-path>.acl_submit_applications ",
      "A": [
        "Enables users to submit a job or application to a specific queue. Username and a group must be defined in a comma separated list. A special value of * allows all the users to submit jobs and applications to the queue."]
    },

    {
      "category": [
        "JAVA","ANNOTATIONS","JAVA_8","@FUNCTIONAL_INTERFACE"
      ],
      "Q": "@Functional interface, what it is?",
      "A": [
        "An informative annotation type used to indicate that an interface type declaration is intended to be a functional interface as defined by the Java Language Specification. Conceptually, a functional interface has exactly one abstract method. Since default methods have an implementation, they are not abstract. If an interface declares an abstract method overriding one of the public methods of java.lang.Object, that also does not count toward the interface's abstract method count since any implementation of the interface will have an implementation from java.lang.Object or elsewhere.
Note that instances of functional interfaces can be created with lambda expressions, method references, or constructor references."]
    },
        {
      "category": [
        "JAVA","ANNOTATIONS","JAVA_8","@FUNCTIONAL_INTERFACE"
      ],
      "Q": "@Functional interface, which interfaces are related to this annotation and why?",
      "A": [
        "java.lang.Runnable, java.awt.event.ActionListener, java.util.Comparator, java.util.concurrent.Callable. They have one method and are mostly used for inner classes. In Java 8 this can be used as lambda expression."]
    },
            {
      "category": [
        "JAVA","ANNOTATIONS","JAVA_8","@FUNCTIONAL_INTERFACE"
      ],
      "Q": "Single Abstract Method interfaces (SAM Interfaces) what it is?",
      "A": [
        "java.lang.Runnable, java.awt.event.ActionListener, java.util.Comparator, java.util.concurrent.Callable. They have one method and are mostly used for inner classes. In Java 8 this can be used as lambda expression. @FuntionalInterface is related to this topic since Java 8."]
    },
            {
      "category": [
        "JAVA","ANNOTATIONS","JAVA_8","@FUNCTIONAL_INTERFACE"
      ],
      "Q": "@FunctionalInterface since which version of Java?",
      "A": [
        "Java 8 (related to lambda expressions)"]
      },
     {
      "category": [
        "JAVA","ANNOTATIONS","JAVA_8","@FUNCTIONAL_INTERFACE"
      ],
      "Q": "How looks code of the simple @FunctionalInterface?",
      "A": [
        "<code>@FunctionalInterface\npublic interface SimpleFuncInterface {\npublic void doWork();\n}</code>"]
      },
          {
      "category": [
        "BASH"
      ],
      "Q": "What is the purpose of using shift in bash scripts??",
      "A": [
        "shift is a bash built-in which kind of removes arguments in beginning of the argument list. Given that the arguments provided to the script are 3 available in $1, $2, $3, then a call to shift will make $2 the new $1"      ]
    },
          {
      "category": [
        "ALGORITMIZATION"
      ],
      "Q": "What is the runtime performance of the get() method in TreeMap and HashMap ,where n represents the number of elements ?",
      "A": [
        "Treemap is according to docuemntation log(n) and HashMap with asumption of correct disperse of element in bucket O(1) - constatn time"
      ]
    },
          {
      "category": [
        "ALGORITMIZATION"
      ],
      "Q": "What is the runtime performance of the get() method in TreeMap and HashMap ,where n represents the number of elements ?",
      "A": [
        "Treemap is according to docuemntation log(n) and HashMap with asumption of correct disperse of element in bucket O(1) - constatn time"
      ]
    },
    {
      "category": [
        "BIGDATA"
      ],
      "Q": "three types of delivery semantics (distributed message queue) and their meaning",
      "A": [
        "at-most-once",
        "at-least-once",
        "and exactly-once"
      ]
    },
    {
      "category": [
        "JAVA"
      ],
      "Q": "How is in Java implemented TreeMap, statisctic in Big O notation",
      "A": [
        "Treemap is sorted according to the natural ordering of its keys, or by a Comparator provided at map creation time, depending on which constructor is used. This implementation provides guaranteed log(n) time cost for the containsKey, get, put and remove operations. Algorithms are adaptations of those in Cormen, Leiserson, and Rivest's Introduction to Algorithms."
      ]
    },
    {
      "category": [
        "ALGORITMIZATION"
      ],
      "Q": "Red-Black tree.",
      "A": [
        ""
      ]
    },
        {
      "category": [
        "ALGORITMIZATION"
      ],
      "Q": "Why and when we use TreeMap ?",
      "A": [
        "We need TreeMap  to get the sorted list of keys in ascending order."
      ]
    },
            {
      "category": [
        "LUCENE","INDEXING","ALGORITMIZATION"
      ],
      "Q": "What is trie, how it look like and wha tis the usage?",
      "A": [
        "a trie, also called digital tree and sometimes radix tree or prefix tree (as they can be searched by prefixes), is an ordered tree data structure that is used to store a dynamic set or associative array where the keys are usually strings. Unlike a binary search tree, no node in the tree stores the key associated with that node; instead, its position in the tree defines the key with which it is associated. It is used to create inverted indexes."
      ]
    },
                {
      "category": [
        "YARN","DEVOPS","YARN_PROPERTIES"
      ],
      "Q": "What does property yarn.scheduler.capacity.root.support.services.minimum-user-limit-percent?",
      "A": [
        "The minimum-user-limit-percent property can be used to set the minimum percentage of resources allocated to each leaf queue user. For example, to enable equal sharing of the \"services\" leaf queue capacity among five users, you would set the minimum- user-limit property to 20%:"]
    },
                    {
      "category": [
        "YARN","DEVOPS","YARN_PROPERTIES"
      ],
      "Q": "Property yarn.scheduler.capacity.root.<queuename>.minimum-user-limit-percent is set to 20, what does it mean?",
      "A": ["first takes 100%, after second job they share 50%, 3 -> 33,3%, 4 -> 25 %, 5 -> 20% and this is the limit, the 6th job must wait, we reach tme minimum resources allocated for job."]
       },
            {
      "category": [
        "JAVA","COLLECTIONS"
      ],
      "Q": "Which classes uses enumerator instead of iterator?",
      "A": [
        "HAsh table, Vector"
      ]
    },
    {
      "category": [
        "JAVA"
      ],
      "Q": "JAVA: How is the difference between Hashmap and Hashtable",
      "A": [
        "Difference between hashmap and hashtable  includes five point  namely Synchronization,Null keys and values,Iterating values , Fail fast iterator ,Performance,Superclass ."
      ]
    },
        {
      "category": [
        "DATABASES"
      ],
      "Q": "What is the difference between views and materialized views?",
      "A": [
        "Materialized views are disk based and are updated periodically based upon the query definition. Views are virtual only and run the query definition each time they are accessed."
      ]
    },
        {
      "category": [
        "DATABASES"
      ],
      "Q": "What means ACID?",
      "A": [
        "Atomicity,Consistency,Isolation,Durability"
      ]
    }
  ]
}
